In [5]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np
from sklearn.model_selection import train_test_split 
from sklearn.linear_model import LinearRegression
from sklearn.linear_model import LogisticRegression 
from sklearn.metrics import accuracy_score
%matplotlib inline
sets= pd.read_csv('/home/codetrade/Downloads/breast.csv')

In [6]:
sets.head()

         A  B  C  D  E  F   G  H  I  J  K
0  1000025  5  1  1  1  2   1  3  1  1  2
1  1002945  5  4  4  5  7  10  3  2  1  2
2  1015425  3  1  1  1  2   2  3  1  1  2
3  1016277  6  8  8  1  3   4  3  7  1  2
4  1017023  4  1  1  3  2   1  3  1  1  2

In [7]:
sets.tail()

          A  B   C   D  E  F  G   H   I  J  K
694  776715  3   1   1  1  3  2   1   1  1  2
695  841769  2   1   1  1  2  1   1   1  1  2
696  888820  5  10  10  3  7  3   8  10  2  4
697  897471  4   8   6  4  3  4  10   6  1  4
698  897471  4   8   8  5  4  5  10   4  1  4

In [8]:
normal=sets[sets.K==2]
fraud=sets[sets.K==4]

In [9]:
print(normal.shape)
print(fraud.shape)

(458, 11)
(241, 11)

In [10]:
normal.K.describe()

count    458.0
mean       2.0
std        0.0
min        2.0
25%        2.0
50%        2.0
75%        2.0
max        2.0
Name: K, dtype: float64

In [11]:
fraud.K.describe()

count    241.0
mean       4.0
std        0.0
min        4.0
25%        4.0
50%        4.0
75%        4.0
max        4.0
Name: K, dtype: float64

In [12]:
sets.groupby('K').mean()

,A,B,C,D,E,F,G,H,I,J
K,,,,,,,,,,
2,1.107591e+06,2.956332,1.325328,1.443231,1.364629,2.120087,1.486900,2.100437,1.290393,1.063319
4,1.003505e+06,7.195021,6.572614,6.560166,5.547718,5.298755,7.634855,5.979253,5.863071,2.589212

In [13]:
normal_transactions=normal.sample(n=241)

In [14]:
new_data=pd.concat([normal_transactions,fraud],axis=0)

In [15]:
new_data.head()

           A  B  C  D  E  F  G  H  I  J  K
625  1183596  3  1  3  1  3  4  1  1  1  2
623  1149548  1  1  1  1  2  1  1  1  1  2
554  1313658  3  1  1  1  2  1  1  1  1  2
447  1058849  5  1  1  1  2  1  1  1  1  2
194  1212422  3  1  1  1  2  1  3  1  1  2

In [16]:
new_data.tail()

           A  B   C   D   E  F   G   H   I  J  K
681  1371026  5  10  10  10  4  10   5   6  3  4
691   695091  5  10  10   5  4   5   4   4  1  4
696   888820  5  10  10   3  7   3   8  10  2  4
697   897471  4   8   6   4  3   4  10   6  1  4
698   897471  4   8   8   5  4   5  10   4  1  4

In [17]:
new_data['K'].value_counts()

2    241
4    241
Name: K, dtype: int64

In [18]:
X=new_data.drop(columns='K', axis=1)
Y=new_data['K']

In [19]:
print(X)

           A  B   C   D   E  F   G   H   I  J
625  1183596  3   1   3   1  3   4   1   1  1
623  1149548  1   1   1   1  2   1   1   1  1
554  1313658  3   1   1   1  2   1   1   1  1
447  1058849  5   1   1   1  2   1   1   1  1
194  1212422  3   1   1   1  2   1   3   1  1
..       ... ..  ..  ..  .. ..  ..  ..  .. ..
681  1371026  5  10  10  10  4  10   5   6  3
691   695091  5  10  10   5  4   5   4   4  1
696   888820  5  10  10   3  7   3   8  10  2
697   897471  4   8   6   4  3   4  10   6  1
698   897471  4   8   8   5  4   5  10   4  1

[482 rows x 10 columns]

In [20]:
X_train,X_test,Y_train,Y_test=train_test_split(X,Y,test_size=0.2,stratify=Y,random_state=2)

In [21]:
print(X.shape, X_train.shape,X_test.shape )

(482, 10) (385, 10) (97, 10)

In [22]:
## Logistics Regression
model1= LogisticRegression()
model2=LinearRegression()

In [23]:
model1.fit(X_train,Y_train)
model2.fit(X_train,Y_train)

LinearRegression()

In [24]:
X_train_prediction=model1.predict(X_train)
training_data_accuracy= accuracy_score(X_train_prediction,Y_train)

In [25]:
print('Accuracy of the Training data :' ,training_data_accuracy)

Accuracy of the Training data : 0.4987012987012987